[{"artist": "Marina Herlop", "album_title": " Pripyat", "genres": ["Electronic"], "label": "Pan", "rating": 8.0, "review": "With Pripyat, conservatory-trained pianist Marina Herlop tears up the rule book in its entirety, transforming each musical element into a toy to play with. Phonetic whoops, spiky piano chords, and thousands of Ableton Live presets splinter into knife-edged shards in the Catalan artist’s music. Her experimental compositions burst with enthusiasm, as multi-tracked choral arrangements flicker over jittery time signatures and electronics fit for Pixar’s sound-effects department. Close your eyes and those million tiny pieces rearrange into a single artwork, one radiant enough to illuminate the darkness. –Nina Corcoran"}, {"artist": "Black Country, New Road", "album_title": " Ants From Up There", "genres": ["Experimental", "Rock"], "label": "Ninja Tune", "rating": 8.4, "review": "It’s almost too apt that the making of an album so fixated on departures ended with its focal creator giving notice to the rest of the band, as singer Isaac Wood did just days before Black Country, New Road released this sophomore triumph. Wood makes the most of his grand finale, packing this sprawling canvas with sorrowful, often bitterly funny musings. Over carnivalesque post-rock as dense and cathartic as his prose, he sings each regret as if he’s Hamlet addressing Yorick’s hoisted skull. Now that’s how you make an exit. –Evan Rytlewski"}, {"artist": "Jeff Parker", "album_title": " Forfolks", "genres": ["Jazz"], "label": "International Anthem / Nonesuch", "rating": 8.2, "review": "What would an echo of our thoughts sound like? Longtime Tortoise member and prolific jazz improviser Jeff Parker offers one possible answer on Forfolks, his second solo guitar album. Laying down spare, suggestive loops on electronic pedals, he pursues ruminative flights of fancy, fleshing out dusty drones and stuttering repetitions with melodic figures that move with the searching quality of a calmly determined mind. Like the best of his work, it is quiet yet commanding, an invitation to drift as well as dream. –Philip Sherburne"}, {"artist": "The Beths", "album_title": " Expert in a Dying Field", "genres": ["Rock"], "label": "Carpark", "rating": 8.0, "review": "The Beths’ third album is less a relationship autopsy than a painstaking vivisection: a razor-sharp scalpel dissecting a love that’s slowly fading out on the operating table. Songwriter Liz Stokes throws caution to the wind, daring to archive every messy detail and new discovery—emerging doubts, backslide fantasies, leering regrets—with near-scientific honesty and hypermelodic abandon. Trading in their last scraps of punk to hone their newfound instincts for lean, clean power-pop, the band turns the painful clarity of post-breakup anguish into one addictive headrush after another. –Phillipe Roberts"}, {"artist": "Arca", "album_title": " KicK iii", "genres": ["Experimental"], "label": "XL", "rating": 8.3, "review": "The centerpiece of a sprawling, five-album cycle, Arca’s KicK iii is a protean climax wedged between more focused experiments in squelching reggaeton and whispery ambient pop. Delving deep into the gnarled industrial textures of her back catalog, the record is governed more by mood than genre, embracing a diabolical temperament that blurs the lines between sadism and masochism. From the rubberized low end of “Señorita” to the nightcored hyperventilation that shakes “Skullqueen,” Arca gives into her most brutal impulses, turning the dancefloor into a brilliant, Boschian hellscape you won’t mind being banished to. –Jude Noel"}, {"artist": "Soccer Mommy", "album_title": " Sometimes, Forever", "genres": ["Rock"], "label": "Loma Vista", "rating": 8.0, "review": "From her very first bedroom recordings, Sophie Allison has wrung every ounce of feeling out of her Stratocaster with minimal adornment, the reverb on her vocals emanating outward like a ghost floating through empty space. But where earlier albums found a woman drowning in her own emotions, Sometimes, Forever reveals that Allison has learned how to swim. She writes the hell out of a hook, whether while holding a candle in the dark (“newdemo”) or aiming a double-barrel at a lover (“Shotgun”). And even though she’s traded in her bedroom for a multi-million-dollar studio and an assist from synth sorcerer Oneohtrix Point Never, she's retained her signature acerbic wit. Against richly textured arrangements that have swelled to match her ambition, she's never sounded more sure of herself. –Matthew Ismael Ruiz"}, {"artist": "Amber Mark", "album_title": " Three Dimensions Deep", "genres": ["Pop/R&B"], "label": "PMR / Interscope", "rating": 8.0, "review": "On her debut album, Amber Mark seeks the answers to life’s biggest questions via soul-baring R&B balladry and funk-tinged pop. The pursuits of love and self-confidence take on a cosmic weight on songs like “Out of This World'' and “Bliss,” intertwining the scientific, spiritual, and physical via her aching, gritty alto. Across 17 sprawling tracks, Mark embarks on a journey that makes the revelation of self-discovery feel like watching a solar eclipse for the first time. –DeAsia Paige "}, {"artist": "Mitski", "album_title": " Laurel Hell", "genres": ["Rock"], "label": "Dead Oceans", "rating": 7.8, "review": "Has exhaustion ever sounded as horribly seductive as it does on Mitski’s sixth album? Laurel Hell was the record that Mitski didn’t want to make: In 2019, she was spent by the success of Be the Cowboy and withdrew from music. But it was the only record she could make, a wearily gorgeous work of dark synth lines, droning guitars, and semi-industrial noise. The album centers around the remarkable one-two punch of “The Only Heartbreaker” and “Love Me More,” two songs so alive with pop zest they seem to have arrived from the hit parade of a parallel universe 1986. –Ben Cardew"}, {"artist": "700 Bliss", "album_title": " Nothing to Declare", "genres": ["Experimental", "Electronic", "Rap"], "label": "Hyperdub", "rating": 8.3, "review": "As Moor Mother or among collective others, Camae Ayewa's releases are world-building almanacs, the present of Black futurism. DJ Haram roots her sound in brain-bending, body-moving, underground club music, then drags it through a raucous sludge. Together as 700 Bliss, they make dance music like Sun Ra made jazz, Grace Jones made dub, or Prince made pop—which is to say, they rocket in all directions at once. Their finest to date, Nothing to Declare constructs floor-filling labyrinths of calls-out to their crews and fuck-yous to the rest, with trap doors to ragers. –Jesse Dorris"}, {"artist": "Oren Ambarchi", "album_title": " Shebang", "genres": ["Experimental"], "label": "Drag City", "rating": 8.1, "review": "Like a time-lapse video of a flower in bloom, Oren Ambarchi’s Shebang is an awe-inspiring exposition of transformation. From the latticework of iridescent guitars that opens the Australian composer-instrumentalist’s album-length composition to its final apex of rapturous polyrhythm, every element is in constant motion. More than just a transfixing expanse of drift and groove, Shebang unfolds like a Music for 18 Musicians for the 21st century, each shift in tone and timbre an invitation to embrace the uncertainty and persistence of change. –Jonathan Williger"}, {"artist": "Jenny Hval", "album_title": " Classic Objects", "genres": ["Experimental"], "label": "4AD", "rating": 8.0, "review": "The latest album from scholarly Norwegian experimentalist Jenny Hval offers a fresh line of artistic inquiry, challenging set-in-stone clichés about romantic desire and political structures. But even when tackling the biggest topics, Hval distills them into pictorial scenes with deliberately glib language and lounge-like grooves. She describes arthouse touchstone The Passion of Joan of Arc, for instance, as “a clever sci-fi movie”; marriage as “a normcore institution.” Hval presents herself as both artist and critic here, spinning the headiest of thoughts into basic, brilliant comedy. In Hval’s world, intelligence and romance only find resolution through their own ridicule. –Emma Madden"}, {"artist": "Chat Pile", "album_title": " God’s Country", "genres": ["Rock"], "label": "The Flenser", "rating": 8.4, "review": "God’s Country might be unbearable if it weren’t so funny. Oklahoma City sludge-noise band Chat Pile’s debut album deals in extreme bleakness: tales of violence and societal collapse, riffs that sound like they’re on the verge of throwing up. Still, there is something sly—and even a little silly—about these songs that somehow heightens the album’s urgency even more. It’s most obvious in “grimace_smoking_weed.jpg,” where the purple McDonald’s mascot appears as a hallucination during a drug-fueled suicidal episode. But it’s also there in “Why,” the album’s most straightforward political critique. “Why do people have to live outside when there are buildings all around us?” asks singer Raygun Busch, his exaggerated matter-of-factness underscoring one of the album’s major themes: America’s oppression and neglect of its most vulnerable residents isn’t just cruel, it’s absurd. –Andy Cush"}, {"artist": "Huerco S.", "album_title": " Plonk", "genres": ["Experimental"], "label": "Incienso", "rating": 8.4, "review": "These brittle jitters aren’t what anyone might expect from the maker of 2016’s contemporary ambient classic For Those of You Who Have Never (And Also Those Who Have). Instead, the pointillistic, percussive sound Brian Leeds, aka Huerco S., developed this time establishes a mood of delicate disequilibrium and suppressed unrest. There’s a pained beauty to the irregular, plucked patterns of “Plonk I,” like a player tentatively grappling with a harp that’s been fitted with serrated strings. Elsewhere, there are echoes of the itchy, intricate ’80s electronic funk of Ryuichi Sakamoto, the parched postmodern jazz of Jon Hassell, and the needlepoint snares of ’90s drum’n’bass, underlining the sense that this album purposefully pulls from across history. File under “nervous ambient.” –Simon Reynolds"}, {"artist": "Weyes Blood", "album_title": " And in the Darkness, Hearts Aglow", "genres": ["Rock"], "label": "Sub Pop", "rating": 8.4, "review": "How do you mourn the loss of what we’re all still living through? Weyes Blood’s Natalie Mering has spent the last few years wrestling with difficult questions about the human species’ slow descent into climate apocalypse, writing tender ballads that situate individual melancholy within a larger politics of collective grief. The second in a series of three albums dedicated to this theme, And in the Darkness, Hearts Aglow wades further into the lonesome nostalgia that has long been among the songwriter’s strengths, finding moments of near-religious ecstasy at the depths of her despair. It’s a eulogy for a dying world, born from a hope that the next one will be better. –Rob Arcand"}, {"artist": "Soul Glo", "album_title": " Diaspora Problems", "genres": ["Rock"], "label": "Epitaph / Secret Voice", "rating": 8.5, "review": "Hardcore is the sound of mortal urgency, of one band dodging obstacles only they can see, at a speed no one could possibly maintain. Part of what makes riotous Philadelphia band Soul Glo’s Diaspora Problems so powerful is how raw and real those obstacles are—cyclical poverty, emotional abuse, the ever-present threat of institutional violence—and how completely vocalist Pierce Jordan turns himself inside out in response, howling and screaming and rapping about generational trauma and the harrowing realities of life as a Black American in a militarized police state. Despite the subject matter, Diaspora Problems feels celebratory, not grim: a scream of pain that testifies, above everything else, to an ironclad will to live. –Jayson Greene"}, {"artist": "MJ Lenderman", "album_title": " Boat Songs", "genres": ["Rock"], "label": "Dear Life", "rating": 8.3, "review": "On a sonic level, no rock album in 2022 felt quite as cozy as Boat Songs. Everything at Asheville, North Carolina singer-songwriter MJ Lenderman’s disposal—his electric guitar tone, his distorted vocals, those thwacking snare drums—blends into a satisfying whole, like a particularly crunchy bite into a grilled cheese sandwich. But what makes Boat Songs transcend mere indie-rock comfort food is Lenderman’s songwriting, which weaves together poetic hallucinations with unglamorous imagery of daily life. When he sings that the food at a recent dinner with friends was great, “if only for being homemade,” you know he means it. In fact, you can almost taste it. –Sam Sodomsky"}, {"artist": "Mavi", "album_title": " Laughing So Hard, It Hurts", "genres": ["Rap"], "label": "Mavo 4 Mayor", "rating": 8.2, "review": "On his second album, Mavi toes the line between exhausted and emboldened, using openhearted vocal melodies to explore his desires, fears, and insecurities. There’s an easy rhythm to the North Carolina rapper’s voice as it saunters over production that fuses lo-fi loops and casual sample chops, surrounding his nuanced soliloquies with a refreshing brightness. When the 23-year-old calmly spits about seasonal depression on “My Good Ghosts” or muses about finding sobriety on “Chinese Finger Trap,” it feels like a conversation with a close friend who’s been through it, and is better for it. –Matthew Ritchie"}, {"artist": "The 1975", "album_title": " Being Funny in a Foreign Language", "genres": ["Rock"], "label": "Dirty Hit", "rating": 8.0, "review": "In 2018, the 1975’s Matty Healy admitted that emotional deflection can be a temporary balm on a song called “Sincerity Is Scary.” But on their fifth album, the British quartet embraces the discomfort that comes with being direct. Atop stripped-back arrangements befitting 11 tracks consumed by matters of the heart, Healy reckons with his tendency to sabotage his own happiness. “I got it/I found it/I’ve just gotta keep it,” he sings of love midway through the record, psyching himself up. Loving—and living—may be a daunting pursuit, but the 1975 sound more than ready to try. –Quinn Moreland"}, {"artist": "Ravyn Lenae", "album_title": " HYPNOS", "genres": ["Pop/R&B"], "label": "Atlantic", "rating": 8.5, "review": "On her debut album, Ravyn Lenae channels the sublimity of outer space while detailing the intimacies of her life on Earth. The Chicago R&B singer and songwriter begins the record heartbroken and betrayed by someone she loves but, even in moments of pain, the precision of her airy falsetto still stuns. The simmering confidence of her vocals is matched up by HYPNOS’ production—courtesy of innovators like Steve Lacy and Kaytranada—which conjures a cosmic funk that’s both familiar and fresh. Across the album, Lenae transforms pain into transcendence: By the time she arrives at the white-hot “Light Me Up” or the exuberant “Xtasy,” she’s finally opened herself back up to starry love. –Vrinda Jagota"}, {"artist": "Hikaru Utada", "album_title": " BADモード", "genres": ["Electronic", "Pop/R&B"], "label": "Sony", "rating": 8.0, "review": "For over two decades, J-pop star Hikaru Utada’s intensely emotional songs have looked for answers to life’s big questions. On BADモード, their searching leads them to pay tribute to house music, along with the glittery sounds of disco, city pop, and ’90s R&B. As they grapple with fear and grief throughout the album, instrumentals co-produced with A.G. Cook, Floating Points, and Skrillex swell and swirl with ecstasy. The club is often imagined as a place of abandon, but BADモード is a reminder that dance music is equally well-suited to accompany catharsis—you might not always find answers, but you can still sweat through the pain. –Colin Joyce"}, {"artist": "Destroyer", "album_title": " Labyrinthitis", "genres": ["Rock"], "label": "Merge", "rating": 8.5, "review": "Dan Bejar has long been a master of dislocation, and on Labyrinthitis, his 13th album as Destroyer, his songwriting hits some profoundly chaotic new peaks. On “June,” a six-and-a-half-minute disco-rap odyssey, his cast of characters includes an idiotic snow angel and a Cubist judge. “Tintoretto, It’s For You” reimagines the Italian painter as some sort of skulking creature of the night. Then, on “Eat the Wine, Drink the Bread,” he describes a conversation between dogs before unleashing a put-down for the ages: “Everything you just said/Was better left unsaid.” It’s all deliberately obscure, and in that obscurity lies beautiful clarity. –Sophie Kemp"}, {"artist": "Rachika Nayar", "album_title": " Heaven Come Crashing", "genres": ["Experimental"], "label": "NNA Tapes", "rating": 8.4, "review": "A first spin of Heaven Come Crashing feels like plugging a high-voltage power line into the base of your spine: You can’t help but sit up straight and pay attention, absorbing every jolt. Brooklyn-based composer-guitarist Rachika Nayar built her second album from shimmering drones, glitches, synth arpeggios, and occasional beats. The record is beautiful, dramatic, and occasionally frightening as it drifts through that emotionally nourishing space where gentle ambient and harsh noise collide. It’s an energy field as much as a piece of music, the kind of record where you can feel your entire body listening. –Mark Richardson"}, {"artist": "billy woods", "album_title": " Aethiopes", "genres": ["Rap"], "label": "Backwoodz Studioz", "rating": 8.0, "review": "billy woods’ eye for detail is as hilarious as it is morbid. On Aethiopes, the Brooklyn indie-rap mainstay’s first of two fantastic albums this year, he describes shipwrecked European colonizers shooting through the water “like God’s semen,” and then deems himself the “multiverse Benzino” before describing a Medusa head whose snake hair is twisted into Senegalese braids. These bizarre cultural mixes are sold with a dead-eyed confidence that’s matched by producer Preservation’s surreal beats. As woods wrings humor and dread out of a spiraling world, the only option is to laugh to keep from crying. –Dylan Green"}, {"artist": "Florist", "album_title": " Florist", "genres": ["Folk/Country"], "label": "Double Double Whammy", "rating": 8.5, "review": "The fourth album from understated indie rockers Florist lands like two decks of hand-crafted playing cards being lovingly shuffled together. One half is a collection of quietly grand folk songs, the other is a stack of ambient fragments sneakily loaded with magnetic, microscopic details that resembles frontwoman Emily A. Sprague’s solo releases. When they dovetail, acoustic reflections sidle up against tiny electrical currents crackling through nature, like fireflies in a humid forest. –Steven Arroyo"}, {"artist": "Perfume Genius", "album_title": " Ugly Season", "genres": ["Pop/R&B"], "label": "Matador", "rating": 8.6, "review": "With Ugly Season, Perfume Genius’ Mike Hadreas descends from the sunlit world of his previous album, 2020’s Set My Heart on Fire Immediately, into a cavernous unknown. “No pattern, no bloom, where I’m taking you,” he sings, entering a realm that’s creaky, vast, and teeming with shadowy creatures. Within these grottoes, there’s a shaft of light in the sweaty “Pop Song,” an empty corridor in the skeletal jazz of “Scherzo,” an errant noise in the rumble of “Hellbent.” As the score to his modern dance experiment, Ugly Season may initially seem like just a side project. But in these recesses you’ll discover Perfume Genius at his most majestic. –Jane Bua"}, {"artist": "Daphni", "album_title": " Cherry", "genres": ["Electronic"], "label": "Jiaolong", "rating": 8.2, "review": "Technically speaking, not much goes on in any given track from Dan Snaith’s third album as Daphni, the Caribou mastermind’s dancefloor outlet. Even the record’s most elaborate arrangements generally come down to a slim handful of elements. In such spartan settings, minor details register with unusual force. A tiny rhythmic irregularity in the title track becomes strangely transfixing as it repeats; gradual modulations make two minutes of unaccompanied synth arpeggio into a bite-sized eternity. The music is minimal but not exactly rigorous, its subtle shifts coming off as instinctive and emotional rather than systematic. The only plan, it seems, is to make your body move. –Andy Cush"}, {"artist": "FKA twigs", "album_title": " CAPRISONGS", "genres": ["Electronic", "Pop/R&B"], "label": "Young", "rating": 7.8, "review": "The Capricorns in our lives have an emotional sense of direction, as if life’s compass were affixed to both their brains and their hearts. FKA twigs uses that intuition to shape her astrology-themed mixtape CAPRISONGS around the idea of resilience as a liberating force. Songs like “oh my love” and the Jorja Smith collab “darjeeling” are equally tough and lithe, while others dabble in mischief. This is twigs quietly marveling at her own beauty and strength, like a NASA image revealing the gorgeous interiority of space hiding in plain sight. –Clover Hope"}, {"artist": "Beth Orton", "album_title": " Weather Alive", "genres": ["Rock"], "label": "Partisan", "rating": 8.7, "review": "Each track on Beth Orton’s eighth album—the first one she self-produced—feels prompted by a forecast: One a warm, rainy night; another a rocky coastline socked in by fog; or a gray countryside bracing for snow. Funded by a personal bank loan Orton took out after she was dropped by her label, Weather Alive’s slow-moving atmospheric systems carry her memory back to times of grief, solitude, and unhealthy self-medication. (Orton summed up her album nicely: “It’s heavy as fuck.”) Amid a palette of muted trumpets, hushed drums, and dampened piano, Orton’s voice crackles and pops out of these songs, like little orange embers. Nothing feels forced out or jammed together; it’s perfectly sturdy, and just a little creaky. –Jeremy D. Larson"}, {"artist": "Charlotte Adigéry / Bolis Pupul", "album_title": " Topical Dancer", "genres": ["Experimental", "Electronic"], "label": "DEEWEE", "rating": 8.2, "review": "At a recent New York show, when Charlotte Adigéry performed “It Hit Me,” her wryly funny, devastatingly naive recollection of being sexually harassed in public at age 13, I witnessed all the men in the room—and only the men in the room—suddenly freeze. That’s the subversive sociological impact of Topical Dancer, in which Adigéry and her musical partner Bolis Pupul mint teen-mag dating advice, racist microaggressions, and dance-music clichés into absurdist Sprechgesang disco with a wickedly political sense of humor. The Belgian duo’s minimalist grooves will keep you rocking until you’re too uncomfortable to move. –Anna Gaca"}, {"artist": "The Smile", "album_title": " A Light for Attracting Attention", "genres": ["Rock"], "label": "XL", "rating": 8.6, "review": "The Smile’s debut resembles a dossier of the sounds and themes favored by Thom Yorke and Jonny Greenwood throughout their more famous band’s long career, but recording under a different moniker seemingly allowed the pair to escape the paralyzingly high expectations of a new Radiohead album. There’s the familiar doomsaying about contemporary society and those spectral melodies that suspend and fall like snow illuminated beneath a streetlight, but also a conceptual playfulness, like “You Will Never Work in Television Again”’s sneering kiss-off to famous perverts. Coming from a different point of view, Yorke and Greenwood find renewed urgency—and seize upon it like young men who’ve never once been burdened with their own reputation. –Jeremy Gordon"}, {"artist": "Cate Le Bon", "album_title": " Pompeii", "genres": ["Rock"], "label": "Mexican Summer", "rating": 8.5, "review": "Faith gets people into all kinds of trouble across Pompeii, the lockdown-era excavation by Welsh seeker Cate Le Bon. The heavens’ inscrutability sends her out of her mind, no relic can hold her pain, God’s routine is good for nothing, and iconography is a con. (Not that she ever stood a chance in the first place: “I was born guilty as sin to a mother guilty as hell,” she sings on “Cry Me Old Trouble.”) To dodge these disappointments, Le Bon suggests, we must learn to embrace ambiguity and to “trust in love, just as you are,” as she intones in the album’s opening words. Pompeii is spectral and sensuous, playful and ruined, like Roxy Music performing “Avalon” on a flickering black-and-white television set—majestically open-ended art rock that exerts an unyielding grip. –Laura Snapes"}, {"artist": "Charli XCX", "album_title": " Crash", "genres": ["Pop/R&B"], "label": "Atlantic", "rating": 8.0, "review": "Crash chronicles not just one but three Charli XCX breakups: with her romantic partner, her longtime label, and the jagged brutalism of her earlier experimental music. In spite of its ambition, her fifth album is still laser-focused and impossibly cool. It’s also deeply referential—like the gleefully on-the-nose Robin S. interpolation that powers “Used to Know Me”—but never beholden to its influences. It’s the only album this year that featured new-jack-hyperpop, a thotty New Order tribute, and a gooey ode to infidelity. If early hits like “I Love It” and “Fancy” made Charli a star, and Pop 2 turned her into an avant-garde hero, Crash just may be the reason why, decades from now, dead-eyed girls and demon gays will still be screaming three words loud enough to reach Satan himself: “It’s Charli, baby.” –Shaad D’Souza"}, {"artist": "Makaya McCraven", "album_title": " In These Times", "genres": ["Jazz"], "label": "International Anthem / Nonesuch / XL", "rating": 8.0, "review": "Across several albums, drummer Makaya McCraven has proven to be a master of repetition, convening jam sessions and looping the results through intricate post-production editing. On In These Times, the Chicago mainstay reaches a high-water mark for this technique, crafting an LP that isn’t quite jazz or ambient or R&B. Throughout the record, he splits the difference between genres, creating amorphous sounds with odd time signatures, untethered to arbitrary tags. Though it took him seven years to complete amid other projects, In These Times proves that patience is virtuous, and that ambiguousness can resonate. –Marcus J. Moore"}, {"artist": "Earl Sweatshirt", "album_title": " Sick!", "genres": ["Rap"], "label": "Tan Cressida / Warner", "rating": 8.1, "review": "Each of Earl Sweatshirt’s albums has chronicled a distinct era of the 28-year-old’s life with stark honesty, and this latest chapter has him wading through a global pandemic while reflecting on the strength of fatherhood. Earl retains his mastery of language on Sick!, guiding us through his innermost thoughts with brevity and clarity, but his perspective on the world is no longer as anguished as it once was. Over beats that are alternately slick and grimy, he’s accepting of the past as he looks to the future with hope. Nimbly, wearily, he acknowledges the pressures around him without succumbing to them. –Matthew Ritchie"}, {"artist": "Nilüfer Yanya", "album_title": " PAINLESS", "genres": ["Pop/R&B"], "label": "ATO", "rating": 8.4, "review": "Time follows feeling on Nilüfer Yanya’s second album: The urgent arpeggios on highlight “stabilise” match the manic all-nighter the British singer-songwriter details in its lyrics, and by the time the drums drop out on the bridge, she’s practically flying. There are whooshing heartbreaks propelled forward by sharp breakbeats, and languid ones that slink alongside alien synths. All the while, Yanya keeps the album’s steady pace with her virtuosic guitar and coolly disciplined vocals. When she finally sinks into the relaxed comfort of closer “anotherlife,” it’s akin to a runner’s afterglow—an elevated heartbeat melting into a deep stretch, as she takes in the marathon she just finished. –Arielle Gordon"}, {"artist": "Jockstrap", "album_title": " I Love You Jennifer B", "genres": ["Electronic", "Experimental", "Pop/R&B"], "label": "Rough Trade", "rating": 8.4, "review": "Even though we’re a good 20 years into the internet-accelerated obliteration of genre boundaries, the debut full-length from UK duo Jockstrap proves there’s still something illicitly thrilling—and occasionally disturbing—in jamming seemingly incompatible sounds together. I Love You Jennifer B alternately comes off like an early-’70s psych-folk album being subjected to a hyperpop remix, a ’90s house party breaking out at a conservatory recital, and Third-era Portishead trapped inside a TikTok feed. Teeming with jarring and joyful juxtapositions, the album’s ugly elegance knows no bounds. –Stuart Berman"}, {"artist": "Grace Ives", "album_title": " Janky Star", "genres": ["Pop/R&B"], "label": "True Panther / Harvest", "rating": 8.4, "review": "Grace Ives’ aptly titled second album is a junk drawer stuffed with offbeat gems. Though the palette is pop, the color combinations she devises atop that base are endless. “Shelly” passes a power-pop love note across the counter of the Twin Peaks diner. “On the Ground” time-warps the introspective, millennial Ives into the Danceteria ’80s. And it’s in risky, high-concept songwriting gambits, like her deployment of the noxious white-collar euphemism “circle back” on the winsome “Angel of Business,” that Ives spins raw quirk into gold thread, tying up all of the album’s disparate ideas into a single shiny package. –Judy Berman"}, {"artist": "Kendrick Lamar", "album_title": " Mr. Morale & The Big Steppers", "genres": ["Rap"], "label": "pgLang / Top Dawg Entertainment / Aftermath / Interscope", "rating": 7.6, "review": "Pain remains unresolved on Mr. Morale & the Big Steppers. Kendrick Lamar spends his fifth album celebrating and decrying his vices and shortcomings; he seeks no absolution, for there is none. There is only searching. While preoccupied with weighty topics like generational scars and the harm we readily inflict upon loved ones, Mr. Morale is not a drag. The moody production ripples with innovation, as Lamar surveys his kingly lot with a shrug: “I can’t please everybody.” After pushing rap’s vanguard forward for a decade, he also knows ego can go only so far. And that’s OK. –Matthew Strauss"}, {"artist": "Björk", "album_title": " Fossora", "genres": ["Electronic", "Pop/R&B"], "label": "One Little Independent", "rating": 8.4, "review": "For her enveloping 10th album, Björk found inspiration in bass clarinets, maternal connections, and, well, mushrooms. Throughout the record, a thick carpet of swampy woodwinds and off-kilter synths meet jumpy gabber beats, wrapping Björk in an inky cloak as she processes the pain of love, the practice of hope, and the death of her mother. Maintaining the anti-conformist approach that’s brought so much color to each season of her life, Björk delivers poignant insights on the universal condition that are a little mischievous, a little mysterious, and completely staggering. –Allison Hussey"}, {"artist": "The Weeknd", "album_title": " Dawn FM", "genres": ["Pop/R&B"], "label": "XO / Republic", "rating": 8.0, "review": "Turns out Abel Tesfaye wasn’t so blinded by the light to see where his megahit was taking him. After obliterating chart records and bringing his bloody and bandaged freak show to the Super Bowl, he returned with the kind of mammoth statement you’d expect from an artist who has scaled pop stardom’s highest peaks. Dawn FM is stuffed silly with icy-hot choruses, Valhalla drum machines, synth patches by the floppy disc, and, why not, some eerie spoken-word cameos from none other than Jim Carrey. Tesfaye occasionally reminds us that he’s still the guy who sang about coke on glass tables and lurid late-night dalliances, but he’s increasingly comfortable finding his hedonistic paradise on the dancefloor, his eyes adjusting to the lights of stadium-filling fame just fine. –Dean Van Nguyen"}, {"artist": "Alex G", "album_title": " God Save the Animals", "genres": ["Rock"], "label": "Domino", "rating": 8.4, "review": "From breakbeat to grunge-pop, God Save the Animals integrates Alex G’s impish genre-muddling into folkish songwriting buffed to a pearlescent sheen. On his most elegantly produced album, Alex Giannascoli welcomes disparate ideas with ease, with images that wiggle like iron filings drawn to a magnetic pole. In mantra-like phrases, he conjures a criminal at confession, the hard-won relief of domesticity, or a seafarer holding onto the fragile hope of love on dry land. As one of indie rock’s great empaths, Giannascoli crafts his songs’ characters with a care that hits poignantly close to home. You feel that the record’s title is no accident, given that humans are animals too. –Owen Myers"}, {"artist": "Yaya Bey", "album_title": " Remember Your North Star", "genres": ["Pop/R&B"], "label": "Big Dada", "rating": 8.6, "review": "Heavy or light, no memory stays buried on Remember Your North Star. Sometimes they’re  sweet: “meet me in brooklyn” sounds like a particularly great first date at the jerk chicken spot. “keisha,” in contrast, details a draining one-way relationship. Over a collection of mostly self-produced beats that range from bright (“pour up”) to woozy (“big daddy ya”) to stripped-down (“street fighter blues”), Bey goes through the ringer but usually circles back to an optimism.“If I just give it to the sky, I bet it might just be/Alright, alright, alright,” she coos, as if willing her dream into existence. –Alphonse Pierre"}, {"artist": "Lucrecia Dalt", "album_title": " ¡Ay!", "genres": ["Experimental"], "label": "Rvng Intl.", "rating": 8.6, "review": "Human beings shed about 500 million skin cells every single day. So even when our brains tell us we couldn’t be more stagnant, on a molecular level, we’re still in a constant state of renewal. Colombian shapeshifter Lucrecia Dalt reminds us of our capacity to change on ¡Ay!, an album that warps time and tradition. It combines Dalt’s woozy takes on the music of her childhood—bolero, salsa, merengue, mambo—with an ambient sci-fi concept involving an alien entity whose body is made up of leftover flecks of skin accumulated within the earth’s hydrosphere. The grounding sounds of clarinets, upright bass, and Dalt’s sensuous voice are juxtaposed with lyrics straight out of a jargony Star Trek adventure: “Tearing through my glandular data gates,” she sings in Spanish. “I bring you the view from nowhen.” "}, {"artist": "Big Thief", "album_title": " Dragon New Warm Mountain I Believe in You", "genres": ["Rock"], "label": "4AD", "rating": 9.0, "review": "Big Thief have always been defined by the interplay between folksy singer-guitarist Adrianne Lenker and her expansive, improvisatory group. In 2019, they released a pair of albums, U.F.O.F. and Two Hands, that seemed to map the range of their sound, from airy and ethereal to ragged and visceral. Three years later, the 20-song double album Dragon New Warm Mountain I Believe in You brings all their breathless styles together, and then some: Consider it contemporary Brooklyn indie rock’s answer to the Beatles’ White Album or Prince’s Sign o’ the Times. Stretching into cracked trip-hop, country hoedowns, and something involving icicles as percussion, Dragon suggested that the limits to what they could do within this framework have yet to be glimpsed. –Marc Hogan"}, {"artist": "Rosalía", "album_title": " Motomami", "genres": ["Pop/R&B"], "label": "Columbia", "rating": 8.4, "review": "“Bro, I’m the first to the studio and the last to leave,” Catalan pop phenom Rosalía recently bragged. It was the post-bout interview, but her latest album MOTOMAMI is the knockout punch. MOTOMAMI is all about contrast, and to craft it, Rosalía painstakingly spliced techniques from bachata, bolero, dembow, and flamenco into one of the year’s most exhilarating records. On opening banger “SAOKO,” she interrupts a buzzing reggaeton synth with free jazz piano. She pierces through gossamer ballad “HENTAI” with rapid-fire drum machine and hypersexual lyrics. And while some artists lean on Auto-Tune to polish subpar vocals, Rosalía, an accomplished cantaora, sneaks it into the more traditional “BULERÍAS” like an alien texture. MOTOMAMI is the sound of Rosalía being intimate in the public eye, restraining soft flesh with rigid leather, and scrawling new verses across ancient texts. –Madison Bloom"}, {"artist": "Bad Bunny", "album_title": " Un Verano Sin Ti", "genres": ["Pop/R&B"], "label": "Rimas", "rating": 8.4, "review": "Bad Bunny’s appeal is as mythical as it is rare: The world’s biggest pop star—a musically inventive, charismatic critic who loves his island—releases the biggest pop album of the year, one that flawlessly effuses the sound and nostalgia of a beach day in the Caribbean. Un Verano Sin Ti marshals reggaeton, dembow, dream-pop, EDM, and mambo, leveraging sex-fueled perreo one moment, only to muse over better futures the next. Whether he’s referencing his “baby gravy” on “Titi Me Preguntó,” or telling the story of a liberated Puerto Rican woman with Buscabulla on “Andrea,” UVST is a sprawling love letter that owns Boricua humor, swagger, and sharp social commentary. The electronic bomba banger “El Apagón” addresses Puerto Rico’s colonial status, gentrification, and ongoing blackouts in an unrelenting yet restorative whirlwind. “Puerto Rico está bien cabrón,” he repeats, almost like a call to action. Un Verano Sin Ti is a resplendent statement on the necessary endurance and conviviality of Caribbean life. –Gio Santiago "}, {"artist": "Special Interest", "album_title": " Endure", "genres": ["Rock"], "label": "Rough Trade", "rating": 8.8, "review": "The tradition of punks making unvarnished pop is vast, but no one has done it like Special Interest, tying in technoise textures, pop-house vocals, and rap cadences while putting hooks inside of screams. On its astounding third full-length, the New Orleans band polishes and chisels its once-blistering sound into a force more palatable and anthemic, but also much more confrontational. Endure is a fiercely original experiment, a world where pleasure and fight entangle into a liberationist menage of club fog, Telfar bags, and discomfiting truths demanding that we “burn it down to build it again.” –Jenn Pelly"}, {"artist": "Alvvays", "album_title": " Blue Rev", "genres": ["Rock"], "label": "Polyvinyl / Transgressive", "rating": 8.8, "review": "Alvvays writes songs about what lasts, what fades, and what young pains resurface in the slipstream of memory. On their third album, the Toronto band returns like one of the old flames in their songs, ready to shatter your every defense. Blue Rev is a crinkled collection of small dramas—a run-in at the pharmacy, a drive-thru break-up over milkshakes—with panoramic feeling. Although Molly Rankin and co. have ascended into the wiser terrain of their 30s, they still summon the dizzying emotions of your rookie years, when the sense of paralysis and betrayal seemed so acute; in their world, college is a bore, pedantic poetry sucks, and solace is that one good song on the radio. This is an album to come home to, with squalling arrangements and melodies so immediate and sublime it’s like you’ve been singing them your whole life. On Blue Rev, Alvvays prove they were the ones all along. –Cat Zhang"}, {"artist": "Sudan Archives", "album_title": " Natural Brown Prom Queen", "genres": ["Pop/R&B"], "label": "Stones Throw", "rating": 9.0, "review": "“I’m not average,” Brittney Parks chants on the title track to Natural Brown Prom Queen, a bright, transformative love letter to herself written in a kaleidoscopic blend of house, R&B, pop, and hip-hop. The L.A. artist has foregrounded her violin before, but Natural Brown Prom Queen’s collagist approach allows Parks’ skillful playing to more elaborately embroider her sharp, often funny lyrics. Themes of self-reliance, family, and heartache emerge in songs that range from no-frills rapping to delicate singsong. With each head-spinning beat change and violin loop, Natural Brown Prom Queen’s musical daredevilry and lyrical honesty guarantee that no one will ever call Parks “average” again. –Eric Torres"}, {"artist": "Beyoncé", "album_title": " Renaissance", "genres": ["Pop/R&B"], "label": "Parkwood Entertainment / Columbia", "rating": 9.0, "review": "Dance music’s liberatory powers are palpable when the lights go low, as the sweat trickles down the small of your back. Renaissance revels in that emancipatory magic, as Beyoncé lends her voice to a Harlem vogue ball, bathes in undulating R&B melismas, and spits over four-on-the-floor rhythms, seamlessly threading it all into her own resplendent cosmology. Watch her golden falsetto levitate on the roller-rink sparkle of “Cuff It.” Feel how a jagged dembow riddim slices through her velvet melodies on “I’m That Girl.” Or let Bey’s demands to release earthly anxieties on “Break My Soul” compel you into movement.\n\nBeyoncé owes the grandeur of her latest reinvention to her queer Black forebears, who fought hard for the refuge of this relief. For many of us, the club is more than just a night out; it’s a nexus of community, a financial ecosystem of survival, and most importantly, an obligatory pleasure practice. Bey captures much of that here, citing her ancestors and contemporaries, sometimes leaving us longing for their actual presence. There are tributes to ballroom DJs, producers, and drag queens Kevin Aviance and Kevin Jz Prodigy, as well as appearances from disco glitterati like Grace Jones and bounce music idol Big Freedia. Each interpolation is potent and precise, yielding a DJ mix and history lesson all at once.\n\nOver the years, Beyoncé’s music has served every function: It can lift a disheveled spirit, vault femme erotics, or treat the wounds of a devastating relationship. But Renaissance eclipses Bey’s previous statements of hard-won self-love and romantic resilience. It does more than revere the dancefloor; it bottles its joy, conviviality, and verve, all while transcending the condition of homage. Its affirmations electrify the body, coursing through the veins like a life-saving shot of adrenaline: Consider the lines “Don’t even waste your time trying to compete with me/No one else in this world can think like me” on “Alien Superstar,” or, “It should cost a billion to look this good” on “Pure/Honey.” As the world burns, Renaissance invites us to remember what it’s like to feel good. -Isabelia Herrera"}]